## PANDAS

## IMPORT PANDAS

In [101]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.3'

In [102]:
s=pd.Series([10,20,30])
s

0    10
1    20
2    30
dtype: int64

In [103]:
df=pd.DataFrame({
    "name":["Aruna","Jashnavi","Madhuri"],
    "age":[21,20,22]
}) 
df

       name  age
0     Aruna   21
1  Jashnavi   20
2   Madhuri   22

## WRITING THE DATA INTO FILES

In [104]:
df.to_csv('data.csv',index=False)

In [105]:
df.to_excel('new.xlsx',sheet_name='weather_data')

## READ THE FILE

In [106]:
df = pd.DataFrame({
    "City":["Kakinada","Anakapalli","Machilipatnam","Vizag","Pallevelugu"],
    "Temperature":[28,29,30,31,32],
    "Humidity":[60,62,58,55,57],
    "Condition":["Sunny","Sunny","Cloudy","Cloudy","Rainy"]
})
df

            City  Temperature  Humidity Condition
0       Kakinada           28        60     Sunny
1     Anakapalli           29        62     Sunny
2  Machilipatnam           30        58    Cloudy
3          Vizag           31        55    Cloudy
4    Pallevelugu           32        57     Rainy

## EXPLORING THE DATA

In [107]:
df.head()

            City  Temperature  Humidity Condition
0       Kakinada           28        60     Sunny
1     Anakapalli           29        62     Sunny
2  Machilipatnam           30        58    Cloudy
3          Vizag           31        55    Cloudy
4    Pallevelugu           32        57     Rainy

In [108]:
df.head(3)

            City  Temperature  Humidity Condition
0       Kakinada           28        60     Sunny
1     Anakapalli           29        62     Sunny
2  Machilipatnam           30        58    Cloudy

In [109]:
df.tail(3)

            City  Temperature  Humidity Condition
2  Machilipatnam           30        58    Cloudy
3          Vizag           31        55    Cloudy
4    Pallevelugu           32        57     Rainy

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         5 non-null      object
 1   Temperature  5 non-null      int64
 2   Humidity     5 non-null      int64
 3   Condition    5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [111]:
df['City'][df['Condition']=='cloudy']

Series([], Name: City, dtype: object)

In [112]:
df.Condition=="Cloudy"

0    False
1    False
2     True
3     True
4    False
Name: Condition, dtype: bool

In [113]:
df.City[df.Condition=="Cloudy"]

2    Machilipatnam
3            Vizag
Name: City, dtype: object

In [114]:
df[df.Condition=="Sunny"]

         City  Temperature  Humidity Condition
0    Kakinada           28        60     Sunny
1  Anakapalli           29        62     Sunny

In [115]:
df.shape

(5, 4)

In [116]:
df[2:4]

            City  Temperature  Humidity Condition
2  Machilipatnam           30        58    Cloudy
3          Vizag           31        55    Cloudy

In [117]:
df.columns

Index(['City', 'Temperature', 'Humidity', 'Condition'], dtype='object')

In [118]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [119]:
df.dtypes

City           object
Temperature     int64
Humidity        int64
Condition      object
dtype: object

In [120]:
df.City

0         Kakinada
1       Anakapalli
2    Machilipatnam
3            Vizag
4      Pallevelugu
Name: City, dtype: object

In [121]:
df.Temperature

0    28
1    29
2    30
3    31
4    32
Name: Temperature, dtype: int64

## MISSING VALUES

In [122]:
df.isnull()

    City  Temperature  Humidity  Condition
0  False        False     False      False
1  False        False     False      False
2  False        False     False      False
3  False        False     False      False
4  False        False     False      False

In [123]:
df.isnull().sum()

City           0
Temperature    0
Humidity       0
Condition      0
dtype: int64

In [124]:
df=pd.DataFrame({
    "name":["Aruna","Madhuri","Jashnavi","Vagdevi"],
    "age":[20,21,19,None]
})
df

       name   age
0     Aruna  20.0
1   Madhuri  21.0
2  Jashnavi  19.0
3   Vagdevi   NaN

In [125]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False
3  False   True

In [126]:
df.isnull().sum()

name    0
age     1
dtype: int64

In [127]:
df[df.isnull().any(axis=1)]

      name  age
3  Vagdevi  NaN

In [128]:
df['age'] = df['age'].fillna(df['age'].mean())

In [129]:
df

       name   age
0     Aruna  20.0
1   Madhuri  21.0
2  Jashnavi  19.0
3   Vagdevi  20.0

In [130]:
df_clean = df.dropna()

In [131]:
df_clean

       name   age
0     Aruna  20.0
1   Madhuri  21.0
2  Jashnavi  19.0
3   Vagdevi  20.0

## DUPLICATES

In [132]:
df=pd.DataFrame({
    "name":["Aruna","Jashnavi","Aruna"],
    "age":[20,19,20]
})
df

       name  age
0     Aruna   20
1  Jashnavi   19
2     Aruna   20

In [133]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [134]:
df[df.duplicated()]

    name  age
2  Aruna   20

In [135]:
df = df.drop_duplicates()
df

       name  age
0     Aruna   20
1  Jashnavi   19

## STATAISTICS

In [136]:
df=pd.read_excel(r"C:\Users\hp\PYTHON\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [137]:
df['Temperature_C'].max()

34

In [138]:
df['Temperature_C'].min()

28

In [139]:
df['Temperature_C'].mean()

np.float64(30.9)

In [140]:
df.Temperature_C.mean()

np.float64(30.9)

In [141]:
df.Temperature_C.median()

31.0

In [142]:
df['Temperature_C'].mode()

0    29
1    31
2    32
Name: Temperature_C, dtype: int64

In [143]:
df['Temperature_C'].describe()

count    10.000000
mean     30.900000
std       1.911951
min      28.000000
25%      29.250000
50%      31.000000
75%      32.000000
max      34.000000
Name: Temperature_C, dtype: float64

In [144]:
df['Temperature_C'].std()

1.911950719959998

In [145]:
df['Temperature_C'].var()

3.6555555555555554

In [146]:
df['Temperature_C'].sum()

np.int64(309)

In [147]:
df['Temperature_C'].count()

np.int64(10)

In [148]:
df['Humidity_%'].count()

np.int64(10)

In [149]:
df['Humidity_%'].sum()

np.int64(601)

In [150]:
df['Humidity_%'].mean()

np.float64(60.1)

In [151]:
df['Humidity_%'].median()

60.5

In [152]:
df['Humidity_%'].mode()

0    62
Name: Humidity_%, dtype: int64

In [153]:
df['Humidity_%'].describe()

count    10.00000
mean     60.10000
std       2.84605
min      55.00000
25%      58.25000
50%      60.50000
75%      62.00000
max      64.00000
Name: Humidity_%, dtype: float64

In [154]:
df['Humidity_%'].var()

8.100000000000001

In [155]:
df[df.Temperature_C == df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore             34          61     Sunny

In [156]:
df.City[df.Temperature_C == df.Temperature_C.max()]

6    Banglore
Name: City, dtype: object

In [157]:
df.count()

Date             10
City             10
Temperature_C    10
Humidity_%       10
Condition        10
dtype: int64

In [158]:
df["City"].nunique()

3

In [159]:
df['City'].value_counts()

City
Hyderbad      4
Banglore      4
Vijayawada    2
Name: count, dtype: int64

## STRING CLEANING

In [160]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [161]:
df['City'] = df['City'].str.lower()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    hyderbad             28          60     Sunny
1 2025-01-02    hyderbad             29          62     Sunny
2 2025-01-03    hyderbad             30          58    Cloudy
3 2025-01-04    hyderbad             31          55    Cloudy
4 2025-01-05    banglore             32          57     Rainy
5 2025-01-06    banglore             33          59     Rainy
6 2025-01-07    banglore             34          61     Sunny
7 2025-01-08    banglore             32          63    Cloudy
8 2025-01-09  vijayawada             31          64     Rainy
9 2025-01-10  vijayawada             29          62     Sunny

In [162]:
df['City'] = df['City'].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

In [163]:
df['Condition'] = df['Condition'].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     SUNNY
1 2025-01-02    HYDERBAD             29          62     SUNNY
2 2025-01-03    HYDERBAD             30          58    CLOUDY
3 2025-01-04    HYDERBAD             31          55    CLOUDY
4 2025-01-05    BANGLORE             32          57     RAINY
5 2025-01-06    BANGLORE             33          59     RAINY
6 2025-01-07    BANGLORE             34          61     SUNNY
7 2025-01-08    BANGLORE             32          63    CLOUDY
8 2025-01-09  VIJAYAWADA             31          64     RAINY
9 2025-01-10  VIJAYAWADA             29          62     SUNNY

In [164]:
df["City"]=df["City"].str.replace("HYDERBAD","CHENNAI")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI             28          60     SUNNY
1 2025-01-02     CHENNAI             29          62     SUNNY
2 2025-01-03     CHENNAI             30          58    CLOUDY
3 2025-01-04     CHENNAI             31          55    CLOUDY
4 2025-01-05    BANGLORE             32          57     RAINY
5 2025-01-06    BANGLORE             33          59     RAINY
6 2025-01-07    BANGLORE             34          61     SUNNY
7 2025-01-08    BANGLORE             32          63    CLOUDY
8 2025-01-09  VIJAYAWADA             31          64     RAINY
9 2025-01-10  VIJAYAWADA             29          62     SUNNY